snlkuharlocal/src/Documents/РеформацияБаланса/РеформацияБаланса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеформацияБаланса</name>
  <registerRecords>AccumulationRegister.Профит</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Профит/Профит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Профит</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклаутры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/РеформацияБаланса/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Подразделение,
	|	СтатьяЗатрат,
	|	СуммаУпрКонечныйОстаток  КАК СумКон
	|ИЗ
	|	РегистрНакопления.Затраты.ОстаткиИОбороты(&Дата2, &Дата2, , , )";
	
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	СписаноЗатрат=0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение=Движения.Затраты.Добавить();	
		
		Движение.Период=Дата;
		
		Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
		Движение.Подразделение	=Выборка.Подразделение;
		Движение.СтатьяЗатрат	=Выборка.СтатьяЗатрат;
		
		Движение.СуммаУпр		=Выборка.СумКон;	
		
		//крохин начало
		Движение.Комментарий        = "реформация баланса";
		//крохин конец
		
		СписаноЗатрат=СписаноЗатрат+Выборка.СумКон;
	КонецЦикла; 
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ВидНоменклатуры,
	|	Подразделение,
	|	СуммаКонечныйОстаток КАК СумКон
	|ИЗ
	|	РегистрНакопления.Профит.ОстаткиИОбороты(&Дата2, &Дата2, , , )";
	
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата));
	
	СписаноПрофита=0;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение=Движения.Профит.Добавить();	
		
		Движение.Период=Дата;
		
		Движение.ВидДвижения		=ВидДвиженияНакопления.Расход;
		Движение.Подразделение		=Выборка.Подразделение;
		Движение.ВидНоменклатуры	=Выборка.ВидНоменклатуры;
		
		Движение.Сумма				=Выборка.СумКон;	
		
		СписаноПрофита=СписаноПрофита+Выборка.СумКон;
	КонецЦикла;
	
	Если НЕ Контрагент.Пустая() Тогда
		ФинРезультат=СписаноПрофита-СписаноЗатрат;
		Движение=Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.Период		=Дата;
		Движение.Контрагент	=Контрагент;
		Движение.Договор	=Договор;
		Движение.СуммаВал	=глПересчет(ФинРезультат,ПараметрыСеанса.ВалютаУпр_2009,Дата,Договор.ВалютаКредита,Дата);
		Движение.СуммаУпр	=ФинРезультат;	
	КонецЕсли;	
КонецПроцедуры
